# ActualSupplyAirflow Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..ActualSupplyAirflow Property
Space Class See Also
---
Get the Actual Supply Airflow of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double ActualSupplyAirflow { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ActualSupplyAirflow As Double
	Get
```

Visual C++
---
```text
public:
property double ActualSupplyAirflow {
	double get ();
}
```

# Remarks
This property is used to get the Actual Supply Airflow (Unit: CFM) of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace